
LENBTNEXCEP = '''Кол-во букв при указании разметки, должны совпадать с кол-вом названии кнопок.
Пример: "b, bb, b", btn1, bnt2, bnt3, bnt3...'''

LENMARKUPEXCEP = '''Указанно больше 3-х кнопок в строке или превышено кол-во строк.
В одной строке может быть только 3 кнопки: Пример "bbb".
Рядов кнопок может быть не больше 12.'''

FEEDBACK_SALUTE_MESSAGE = '''Сбор обратной связи пока не ведется!''' # TODO расписать сообщение приветствия, при сборе обратной связи! 
BOT_UNKNOWN_TEXT_COMMAND = '''Бот не знает такой команды'''
